Revit 2027 API
FillPattern.IsSolidFill Property
 Check if the fill pattern is a solid fill pattern.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsSolidFill { get; }
Public ReadOnly Property IsSolidFill As Boolean
	Get
public:
property bool IsSolidFill {
	bool get ();
}
member IsSolidFill : bool with get
Property Value
Boolean
See Also
Reference
FillPattern Class
Autodesk.Revit.DB Namespace